# SpaceConstruction Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..SpaceConstruction Property
Space Class See Also
---
Get the Space Construction of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPSpaceConstruction SpaceConstruction { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SpaceConstruction As MEPSpaceConstruction
	Get
```

Visual C++
---
```text
public:
property MEPSpaceConstruction^ SpaceConstruction {
	MEPSpaceConstruction^ get ();
}
```

# Remarks
This property is used to get the Space Construction of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace